Revit 2024 API
OverrideGraphicSettings.DetailLevel Property
 The detail level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ViewDetailLevel DetailLevel { get; }
Visual Basic
Public ReadOnly Property DetailLevel As ViewDetailLevel
	Get
Visual C++
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace